In [1]:
import numpy as np
import pandas as pd

In [2]:
#Read a CSV file

weather= pd.read_csv(r'C:/Users/Santhosh/GitHub/MachineLearning/Pandas/nyc_weather.csv')

In [3]:
weather

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333
5,1/6/2016,33,4,35,30.50,10,4.0,0,0,NaN,259
6,1/7/2016,39,11,33,30.28,10,2.0,0,3,NaN,293
7,1/8/2016,39,29,64,30.20,10,4.0,0,8,NaN,79
8,1/9/2016,44,38,77,30.16,9,8.0,T,8,Rain,76
9,1/10/2016,50,46,71,29.59,4,NaN,1.8,7,Rain,109
10,1/11/2016,33,8,37,29.92,10,NaN,0,1,NaN,289
11,1/12/2016,35,15,53,29.85,10,6.0,T,4,NaN,235
12,1/13/2016,26,4,42,29.94,10,10.0,0,0,NaN,284
13,1/14/2016,30,12,47,29.95,10,5.0,T,7,NaN,266
14,1/15/2016,43,31,62,29.82,9,5.0,T,2,NaN,101
15,1/16/2016,47,37,70,29.52,8,7.0,0.24,7,Rain,340
16,1/17/2016,36,23,66,29.78,8,6.0,0.05,6,Fog-Snow,345
17,1/18/2016,25,6,53,29.83,9,12.0,T,2,Snow,293
18,1/19/2016,22,3,42,30.03,10,11.0,0,1,NaN,293
19,1/20/2016,32,15,49,30.13,10,6.0,0,2,NaN,302
20,1/21/2016,31,11,45,30.15,10,6.0,0,1,NaN,312
21,1/22/2016,26,6,41,30.21,9,NaN,0.01,3,Snow,34
22,1/23/2016,26,21,78,29.77,1,16.0,2.31,8,Fog-Snow,42
23,1/24/2016,28,11,53,29.92,8,6.0,T,3,Snow,327
24,1/25/2016,34,18,54,30.25,10,3.0,0,2,NaN,286
25,1/26/2016,43,29,56,30.03,10,7.0,0,2,NaN,244
26,1/27/2016,41,22,45,30.03,10,7.0,T,3,Rain,311
27,1/28/2016,37,20,51,29.90,10,5.0,0,1,NaN,234
28,1/29/2016,36,21,50,29.58,10,8.0,0,4,NaN,298
29,1/30/2016,34,16,46,30.01,10,7.0,0,0,NaN,257
30,1/31/2016,46,28,52,29.90,10,5.0,0,0,NaN,241

In [4]:
#Maximum Temperature

weather['Temperature'].max()

50

In [5]:
#Raining days

weather[weather['Events']=='Rain']

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
8,1/9/2016,44,38,77,30.16,9,8.0,T,8,Rain,76
9,1/10/2016,50,46,71,29.59,4,NaN,1.8,7,Rain,109
15,1/16/2016,47,37,70,29.52,8,7.0,0.24,7,Rain,340
26,1/27/2016,41,22,45,30.03,10,7.0,T,3,Rain,311

In [6]:
#Average Wind Speed

weather['WindSpeedMPH'].mean()

6.892857142857143

In [7]:
#Create a DataFrame using list of Tuples
#DataFrame is like a Table or Excel sheet with Rows and columns

weather_data=[('1/1/2017',32,6,'Rain'),
             ('1/2/2017',33,7,'Snow'),
             ('1/3/2017',21,5,'Sunny'),
             ('1/4/2017',222,9,'Rain')]

weather_data

[('1/1/2017', 32, 6, 'Rain'),
 ('1/2/2017', 33, 7, 'Snow'),
 ('1/3/2017', 21, 5, 'Sunny'),
 ('1/4/2017', 222, 9, 'Rain')]

In [8]:
#How to create a columns
weather_data=pd.DataFrame(weather_data,columns=['Day','Temp','Wind','Events'])

In [9]:
weather_data

        Day  Temp  Wind Events
0  1/1/2017    32     6   Rain
1  1/2/2017    33     7   Snow
2  1/3/2017    21     5  Sunny
3  1/4/2017   222     9   Rain

In [10]:
weather_data.shape #3 rows and 4 features

(4, 4)

In [11]:
weather_data.columns

Index(['Day', 'Temp', 'Wind', 'Events'], dtype='object')

In [12]:
weather_data[1:] #Slicing

        Day  Temp  Wind Events
1  1/2/2017    33     7   Snow
2  1/3/2017    21     5  Sunny
3  1/4/2017   222     9   Rain

In [13]:
weather_data['Day']

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
Name: Day, dtype: object

In [14]:
weather_data[['Day','Events']] #Selecting a column

        Day Events
0  1/1/2017   Rain
1  1/2/2017   Snow
2  1/3/2017  Sunny
3  1/4/2017   Rain

In [15]:
weather_data['Temp'].describe() #High level statistics

count      4.00000
mean      77.00000
std       96.81942
min       21.00000
25%       29.25000
50%       32.50000
75%       80.25000
max      222.00000
Name: Temp, dtype: float64

In [16]:
#Day with High Temperture

weather_data['Day'] [weather_data['Temp']== weather_data['Temp'].max()]

3    1/4/2017
Name: Day, dtype: object

# Operations in Data Frame

In [17]:
type(weather)

pandas.core.frame.DataFrame

In [18]:
#convering dataframe to csv

weather.to_csv('Weather.csv')

In [19]:
weather.to_excel('Weather_Without_Index.xlsx',sheet_name='WEATHER_DATA',index=False)

In [35]:
data=[('1/1/2017','Madurai',32,6,'Rain'),
     ('1/1/2017','Chennai',33,7,'Snow'),
    ('1/1/2017','Coimbatore',21,5,'Snow'),
      ('1/2/2017','Madurai',33,6,'Rain'),
     ('1/2/2017','Chennai',35,7,'Snow'),
    ('1/2/2017','Coimbatore',28,5,'Sunny')]

In [36]:
data = pd.DataFrame(data,columns=['Day','City','Temp','Wind','Events'])

In [37]:
type(data)

pandas.core.frame.DataFrame

In [38]:
g=data.groupby('City')

In [39]:
data

        Day        City  Temp  Wind Events
0  1/1/2017     Madurai    32     6   Rain
1  1/1/2017     Chennai    33     7   Snow
2  1/1/2017  Coimbatore    21     5   Snow
3  1/2/2017     Madurai    33     6   Rain
4  1/2/2017     Chennai    35     7   Snow
5  1/2/2017  Coimbatore    28     5  Sunny

In [40]:
for city,city_df in g:
    print(city)
    print(city_df)

Chennai
        Day     City  Temp  Wind Events
1  1/1/2017  Chennai    33     7   Snow
4  1/2/2017  Chennai    35     7   Snow
Coimbatore
        Day        City  Temp  Wind Events
2  1/1/2017  Coimbatore    21     5   Snow
5  1/2/2017  Coimbatore    28     5  Sunny
Madurai
        Day     City  Temp  Wind Events
0  1/1/2017  Madurai    32     6   Rain
3  1/2/2017  Madurai    33     6   Rain

In [41]:
g.get_group('Madurai')

        Day     City  Temp  Wind Events
0  1/1/2017  Madurai    32     6   Rain
3  1/2/2017  Madurai    33     6   Rain

In [42]:
print(g.max())

                 Day  Temp  Wind Events
City
Chennai     1/2/2017    35     7   Snow
Coimbatore  1/2/2017    28     5  Sunny
Madurai     1/2/2017    33     6   Rain

In [43]:
print(g.mean())

            Temp  Wind
City
Chennai     34.0   7.0
Coimbatore  24.5   5.0
Madurai     32.5   6.0

In [44]:
print(g.describe()) #Will give temprature and Wind Statistics (integer)

            Temp                                                  Wind       \
           count  mean       std   min    25%   50%    75%   max count mean
City
Chennai      2.0  34.0  1.414214  33.0  33.50  34.0  34.50  35.0   2.0  7.0
Coimbatore   2.0  24.5  4.949747  21.0  22.75  24.5  26.25  28.0   2.0  5.0
Madurai      2.0  32.5  0.707107  32.0  32.25  32.5  32.75  33.0   2.0  6.0


            std  min  25%  50%  75%  max
City
Chennai     0.0  7.0  7.0  7.0  7.0  7.0
Coimbatore  0.0  5.0  5.0  5.0  5.0  5.0
Madurai     0.0  6.0  6.0  6.0  6.0  6.0

In [45]:
print(g.describe(include='object'))

             Day                       Events
           count unique       top freq  count unique    top freq
City
Chennai        2      2  1/1/2017    1      2      1   Snow    2
Coimbatore     2      2  1/1/2017    1      2      2  Sunny    1
Madurai        2      2  1/1/2017    1      2      1   Rain    2

# Concatenate Data Frames

In [46]:
india_weather=pd.DataFrame({
    'city':['Madurai','Chennai','Ooty'],
    'Temp':[34,35,22],
    'Humidity':[80,70,66]
})

In [47]:
india_weather

      city  Temp  Humidity
0  Madurai    34        80
1  Chennai    35        70
2     Ooty    22        66

In [48]:
us_weather=pd.DataFrame({
    'city':['NewYork','Chicago','Atlanta'],
    'Temp':[22,18,19],
    'Humidity':[52,46,48]
})

In [49]:
us_weather

      city  Temp  Humidity
0  NewYork    22        52
1  Chicago    18        46
2  Atlanta    19        48

In [56]:
pd.concat([india_weather,us_weather])

      city  Temp  Humidity
0  Madurai    34        80
1  Chennai    35        70
2     Ooty    22        66
0  NewYork    22        52
1  Chicago    18        46
2  Atlanta    19        48

In [58]:
pd.concat([india_weather,us_weather],ignore_index=True) #To get unique indexes

      city  Temp  Humidity
0  Madurai    34        80
1  Chennai    35        70
2     Ooty    22        66
3  NewYork    22        52
4  Chicago    18        46
5  Atlanta    19        48

In [60]:
pd.concat([india_weather,us_weather],ignore_index=True,axis=1) #Rowwise concatenation

         0   1   2        3   4   5
0  Madurai  34  80  NewYork  22  52
1  Chennai  35  70  Chicago  18  46
2     Ooty  22  66  Atlanta  19  48

# Merge Data Frames

In [62]:
 temperature_df = pd.DataFrame({
     'City':['Madurai','Goa','Bangalore','Chennai'],
     'Temperature':[35,26,28,36]
 })

In [63]:
 humidity_df = pd.DataFrame({
     'City':['Madurai','Bangalore','Chennai'],
     'Humidity':[80,86,83]
 })

In [64]:
pd.merge(temperature_df,humidity_df,on='City') #Basically its INNER-JOIN

        City  Temperature  Humidity
0    Madurai           35        80
1  Bangalore           28        86
2    Chennai           36        83

In [66]:
pd.merge(temperature_df,humidity_df,on='City',how='outer')

        City  Temperature  Humidity
0    Madurai           35      80.0
1        Goa           26       NaN
2  Bangalore           28      86.0
3    Chennai           36      83.0

# Numerical Indexing

In [67]:
df=pd.DataFrame([1,2,3,4,5,6,7,8,9,10],
               index=[50,49,48,47,46,45,44,43,42,41])

In [68]:
df

     0
50   1
49   2
48   3
47   4
46   5
45   6
44   7
43   8
42   9
41  10

In [69]:
df.loc[46] #access using index

0    5
Name: 46, dtype: int64

In [70]:
df.loc[4] #Key Error

KeyError: 'the label [4] is not in the [index]'

In [72]:
df.iloc[3] #3rd Index / 4th row

0    4
Name: 47, dtype: int64

In [73]:
df.iloc[:3]

    0
50  1
49  2
48  3

In [75]:
df.loc[2:] #It wont throw an error, but it will show elements from this index

Empty DataFrame
Columns: [0]
Index: []

In [79]:
df.loc[:48] #Will show till 48th Index

    0
50  1
49  2
48  3